# ASSIGNMENT4

#### 1.Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

In [93]:
#Import necessary libraries

import numpy as np
import pandas as pd

In [94]:
df=pd.read_csv('housingdata.csv')
print('the first six rows of the dataframe is :-')
df.head(6)

the first six rows of the dataframe is :-

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

#### 2.Display the column names and r ow index in separate cells.

In [95]:
# Display the column names

print('thr column names are as follows:')
print(list(df.columns))

thr column names are as follows:
['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

In [96]:
# Display the row index

print("The row index is:")
print(list(df.index))

The row index is:
[0, 1, 2, 3, 4, 5, 6, 7, 8]

#### 3.a) How many numbers of “STATE” exist in the dataset. Hint: use shape

In [97]:
# Count number of states in the given dataset

print(F"there are {df.shape[0]} number of state in the dataset")

there are 9 number of state in the dataset

#### b) How many unique states exist in the dataset

In [98]:
print(F"there are {df['STATE'].nunique()} unique states in the dataset")

there are 6 unique states in the dataset

#### 4.Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list

In [99]:
# Getting the required NaN values
nan_boolval_df= df.isnull()

#Getting a boolean list

nan_boolval_list = nan_boolval_df.values.flatten().tolist()
#displaying the boolean list

print(nan_boolval_list)

[False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, True, False, True, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False]

#### 5.Drop all rows with N/A,NA,na values in Num_Bedrooms

In [100]:
print(df)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [101]:
#Replacing na with NaN values
df['NUM_BEDROOMS']=df['NUM_BEDROOMS'].replace('na',np.nan)

# removing the rows with NaN values in NUM_BEDROOM column
df = df.dropna(subset=['NUM_BEDROOMS'])

# Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

#### 6.Replace the NaN and String entries in Num_Bath with previous entry

In [102]:
#replacing non numeric enteries with NaN 
df['NUM_BATH']=pd.to_numeric(df['NUM_BATH'],errors='coerce')

#performimg forward fill method
# df['NUM_BATH'] = df['NUM_BATH'].fillna(method='ffill')
df['NUM_BATH'] = df['NUM_BATH'].ffill()

#display altered dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654            3       1.0  1000
1  100002000.0  MAHARASHTRA      21325            3       1.5    --
3  100004000.0           TN     321321            1       1.5   700
4          NaN           TN  589465645            3       2.0  1600
6  100007000.0        ASSAM    3222321            2       2.0   950
7  100008000.0           HP      23131            1       1.0   NaN

#### 7.Replace the empty values in “SQ_FT” with the mean of the all entries.

In [103]:
#replacing non numeric enteries with nan
df['SQ_FT']=pd.to_numeric(df['SQ_FT'],errors='coerce')

print(df)

#filling null values with mean

df['SQ_FT']=df['SQ_FT'].fillna(df['SQ_FT'].mean())

#altered data frame is 

print("\n",df)

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325            3       1.5     NaN
3  100004000.0           TN     321321            1       1.5   700.0
4          NaN           TN  589465645            3       2.0  1600.0
6  100007000.0        ASSAM    3222321            2       2.0   950.0
7  100008000.0           HP      23131            1       1.0     NaN

            PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325            3       1.5  1062.5
3  100004000.0           TN     321321            1       1.5   700.0
4          NaN           TN  589465645            3       2.0  1600.0
6  100007000.0        ASSAM    3222321            2       2.0   950.0
7  100008000.0           HP      23131            1       1.0  1062.5

#### 8.8. What is the sum of SQ_FT of all entries in the dataset.

In [105]:
print(F"the sum of the SQ_FT of all the entries in the dataset is {df['SQ_FT'].sum()} sq-ft")

the sum of the SQ_FT of all the entries in the dataset is 6375.0 sq-ft

#### 9.Add a new column “NUM_STORE” and with all the values as 1 for all rows

In [107]:
#adding solumn NUM_STORE with values 1
df['NUM_STORES']=1
#Displaying altered dataframe
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORES
0,100001000.0,MP,321654,3,1.0,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2.0,1600.0,1
6,100007000.0,ASSAM,3222321,2,2.0,950.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

#### 10. Create a DataFrame containing all entries of TN state only

In [108]:
#creating a new data for tn

tn_data = df['STATE'] == 'TN'

#applying the data to create a new dataframe df_tn

df_tn = df[tn_data]

#displaying the new dataframe

df_tn

           PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORES
3  100004000.0    TN     321321            1       1.5   700.0           1
4          NaN    TN  589465645            3       2.0  1600.0           1

#### 11. Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame

In [109]:
# creating new data 
sq_ft_data = df['SQ_FT'] >1000

#applying the data to create a new dataframe df_sq_ft

df_sq_ft=df[sq_ft_data]

#displaying the dataframe

df_sq_ft

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORES
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2.0,1600.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

#### 12. Create a DataFrame having only first Three columns and First Three rows

In [110]:
# creating a new dataframe having first 3 rows and 3 columns

df_3x3 = df.iloc[:3,:3]

#displaying altered dataframe

df_3x3

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
3  100004000.0           TN  321321

#### 13. Display the state having highest average price per square foot of housing area. Hint: Average of TotalPrice/Sq_

In [115]:
# calculation of total price per sq ft
df['PRICE_PER_SQ_FT'] = df['PRICE']/df['SQ_FT']

#Finding Average of Price Per Sq-Ft grouped by STATE and sorting in descending order
state_avg_price_per_sq_ft = df.groupby('STATE')['PRICE_PER_SQ_FT'].mean().sort_values(ascending=False)

#Displaying the state having highest average price per square foot of housing area.

print(F"The state having highest average price per square foot of housing area is {(state_avg_price_per_sq_ft.index)[0]}.")

The state having highest average price per square foot of housing area is TN.